uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ПредназначенияЭлементовСтруктурыОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПредназначенияЭлементовСтруктурыОтчета</name>
  <enumValues>
    <name>ПроизвольныеДанные</name>
  </enumValues>
  <enumValues>
    <name>ОборотноСальдоваяВедомость</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияДенежныхСредств</name>
  </enumValues>
  <enumValues>
    <name>БюджетДоходовИРасходов</name>
  </enumValues>
  <enumValues>
    <name>БюджетДвиженияРесурсов</name>
  </enumValues>
  <enumValues>
    <name>ТрансформационныеКорректировки</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ПредназначенияЭлементовСтруктурыОтчета/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДвиженияДенежныхСредств);
	ДанныеВыбора.Добавить(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.БюджетДоходовИРасходов);
	
	Если НЕ Параметры.Свойство("ТолькоВидыБюджетов") Тогда
		ДанныеВыбора.Добавить(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ОборотноСальдоваяВедомость);
		ДанныеВыбора.Добавить(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ТрансформационныеКорректировки);
		ДанныеВыбора.Добавить(Перечисления.ПредназначенияЭлементовСтруктурыОтчета.ПроизвольныеДанные);
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
